# Python: pandas. Práctica y ejercicios

**NOTAS**
 - Hay muchas formas de resolver cada problema, encuentra la tuya.
 - Crea las celdas extra que necesites.
 - Recuerda que una celda puede ser de tipo Código, o de tipo Markdown. Utiliza las segundas para escribir texto y explicaciones si lo precisas.
 - Intenta crear variables a la hora de resolver los ejercicios.
 - Puedes apoyarte en internet: todos los programadores lo hacemos a diario.

<img width=500 src="https://upload.wikimedia.org/wikipedia/commons/3/31/TitanicBeken.jpg">

Importamos el csv del titanic a un dataframe

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../datasets/titanic.csv")

Echa un vistazo a las primeras filas del dataframe

In [3]:
df.head(3)

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0

In [4]:
df.tail(2)

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1307,"Gustafsson, Mr. Anders Vilhelm",male,37.0,3,2,0,3101276,7.9250,NaN,S,0
1308,"McDermott, Miss. Brigdet Delia",female,NaN,3,0,0,330932,7.7875,NaN,Q,1

Cuántos pasajeros hay en este dataframe?

In [5]:
df.shape

(1309, 11)

In [6]:
df.shape[0]

1309

Cuáles son las columnas del dataframe?

In [7]:
df.columns

Index(['Name', 'Sex', 'Age', 'Pclass', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked', 'Survived'],
      dtype='object')

Enumera las columnas de tipo numérico

In [8]:
df.dtypes

Name         object
Sex          object
Age         float64
Pclass        int64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
Survived      int64
dtype: object

Cuál es la edad media de los pasajeros? Y la mediana? Cómo interpretas el resultado?

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.Age.mean().round(1)

29.9

In [11]:
df.Age.median().round(1)

28.0

<img width=400 src="https://miro.medium.com/v2/resize:fit:846/1*XU3Kdl521XnWHECHZ7XOaQ.jpeg">

Cuánto costó el billete más caro? Quién lo pagó?

In [12]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [13]:
df.Fare.max()

512.3292

In [14]:
df[df.Fare == df.Fare.max()]

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
255,"Cardeza, Mrs. James Warburton Martinez",female,58.0,1,0,1,PC 17755,512.3292,B51 B53 B55,C,1
272,"Lesurer, Mr. Gustave J",male,35.0,1,0,0,PC 17755,512.3292,B101,C,1
543,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,1,0,1,PC 17755,512.3292,B51 B53 B55,C,1
1152,"Ward, Miss. Anna",female,35.0,1,0,0,PC 17755,512.3292,NaN,C,1

In [15]:
for passenger in df[df.Fare == df.Fare.max()].Name.values:
    print(f"El pasajero {passenger} pagó {df.Fare.max()}")

El pasajero Cardeza, Mrs. James Warburton Martinez pagó 512.3292
El pasajero Lesurer, Mr. Gustave J pagó 512.3292
El pasajero Cardeza, Mr. Thomas Drake Martinez pagó 512.3292
El pasajero Ward, Miss. Anna pagó 512.3292

Cuánto pagaron entre todos los pasajeros?

Habría que chequear si hay algún dato faltante

In [16]:
df.Fare.isna().sum()

1

In [17]:
df.Fare.sum()

43550.4869

Quién era el pasajero más joven y qué edad tenía?

In [18]:
df.Age.min()

0.17

In [19]:
df[df.Age == df.Age.min()]

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
151,"Dean, Miss. Elizabeth Gladys Millvina",female,0.17,3,1,2,C.A. 2315,20.575,NaN,S,1

Cuántos pasajeros eran menores de 20? Qué porcentaje?

In [20]:
(df.Age < 20).sum()

225

or

In [21]:
df[df.Age < 20].shape[0]

225

Cual es el decil 9 de la edad?

In [22]:
df.Age.quantile(0.90)

50.0

Cuánta gente sobrevivió? Cuánta murió?

In [23]:
df.Survived.value_counts()

0    809
1    500
Name: Survived, dtype: int64

Cuánta gente viajaba en cada clase?

In [24]:
df.Pclass.value_counts().sort_index()

1    323
2    277
3    709
Name: Pclass, dtype: int64

Era más probable sobrevivir siendo de primera clase?

In [25]:
pd.crosstab(df.Pclass, df.Survived, normalize="index").round(2)

Survived     0     1
Pclass
1         0.38  0.62
2         0.57  0.43
3         0.74  0.26

Era más probable sobrevivir siendo mujer?

In [26]:
pd.crosstab(df.Sex, df.Survived, normalize="index").round(2)

Survived     0     1
Sex
female    0.27  0.73
male      0.81  0.19

Estaría bien ver la probabilidad combinada de clase y sexo....y ver qué segmento de los seis posibles es el de mayor probabilidad de supervivencia

In [27]:
pd.crosstab(df.Pclass, df.Sex)

Sex     female  male
Pclass
1          144   179
2          106   171
3          216   493

In [28]:
df.Sex.unique()

array(['male', 'female'], dtype=object)

In [29]:
sorted(df.Pclass.unique())

[1, 2, 3]

In [30]:
df[(df.Sex == "male") & (df.Pclass == 1)].Survived.mean() * 100

34.07821229050279

In [31]:
for sex in df.Sex.unique():
    for class_ in sorted(df.Pclass.unique()):
        proportion_lived = df[(df.Sex == sex) & (df.Pclass == class_)].Survived.mean()
        print(f"La media de supervivencia de l@s {sex} de clase {class_} fue {round(proportion_lived * 100, 1)}%")

La media de supervivencia de l@s male de clase 1 fue 34.1%
La media de supervivencia de l@s male de clase 2 fue 14.6%
La media de supervivencia de l@s male de clase 3 fue 15.2%
La media de supervivencia de l@s female de clase 1 fue 96.5%
La media de supervivencia de l@s female de clase 2 fue 88.7%
La media de supervivencia de l@s female de clase 3 fue 49.1%

In [32]:
(df.groupby(["Sex", "Pclass"]).Survived.mean() * 100).round(1)

Sex     Pclass
female  1         96.5
        2         88.7
        3         49.1
male    1         34.1
        2         14.6
        3         15.2
Name: Survived, dtype: float64

Con cuántos familiares viajaba la gente? (informado en la columna SibSp)

In [33]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [34]:
df.SibSp.value_counts().sort_index()

0    891
1    319
2     42
3     20
4     22
5      6
8      9
Name: SibSp, dtype: int64

In [35]:
df[df.SibSp == 8]

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
77,"Sage, Master. William Henry",male,14.5,3,8,2,CA. 2343,69.55,NaN,S,0
105,"Sage, Mr. Frederick",male,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
232,"Sage, Miss. Stella Anna",female,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
271,"Sage, Mr. Douglas Bullen",male,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
317,"Sage, Master. Thomas Henry",male,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
523,"Sage, Miss. Ada",female,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
871,"Sage, Mr. George John Jr",male,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
1211,"Sage, Miss. Constance Gladys",female,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
1277,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,3,8,2,CA. 2343,69.55,NaN,S,0

Cuántas puertas de embarque había?

In [36]:
df.Embarked.nunique()

3

In [37]:
df.Embarked.unique()

array(['S', 'Q', 'C', nan], dtype=object)

In [38]:
df.Embarked.value_counts()

S    914
C    270
Q    123
Name: Embarked, dtype: int64

Crea un dataframe con las personas que viajaban en primera clase

In [39]:
df_primera_clase = df[df.Pclass == 1]

In [40]:
df_primera_clase.sample(5)

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
893,"Leader, Dr. Alice",female,49.0,1,0,0,17465,25.9292,D17,S,1
681,"Wright, Mr. George",male,62.0,1,0,0,113807,26.5500,NaN,S,0
382,"Bonnell, Miss. Caroline",female,30.0,1,0,0,36928,164.8667,C7,S,1
44,"Ryerson, Master. John Borie",male,13.0,1,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,1
284,"Chevre, Mr. Paul Romaine",male,45.0,1,0,0,PC 17594,29.7000,A9,C,1

Crea un dataframe que contenga mujeres y niños

In [41]:
df_botes = df[(df.Sex == "female") | (df.Age < 18)]

In [42]:
df_botes.Survived.mean()

0.6751824817518248

Crea un dataframe con la gente que no viajara en la `S`

In [43]:
df_no_S = df[~(df.Embarked == "S")]

Crea una columna con el título de cada pasajero

In [44]:
frase = "me gusta el arroz con leche"

In [45]:
frase.split("a")

['me gust', ' el ', 'rroz con leche']

In [46]:
email = "manolete@hotmail.com"

In [47]:
email.split("@")[1].split(".")[0]

'hotmail'

In [48]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [49]:
df["title"] = df.Name.str.split(", ").str[1].str.split(". ").str[0]

In [50]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,title
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0,Mr
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1,Mrs
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0,Mrs
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1,Mrs
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1,Miss

In [51]:
df.title.value_counts()

Mr          757
Miss        259
Mrs         179
Master       61
Mrs.         18
Dr            8
Rev           8
Col           4
Major         2
Mlle          2
Ms            2
Lady.         1
Miss.         1
Don           1
Sir           1
Mme           1
Capt          1
Jonkheer      1
Dona          1
th            1
Name: title, dtype: int64

Crea una columna booleana que almacene si el pasajero es mayor de edad

In [56]:
df["is_big"] = df.Age >= 18

In [57]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,title,is_big
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0,Mr,True
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1,Mrs,True
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0,Mrs,True
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1,Mrs,True
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1,Miss,True

In [59]:
df.to_csv("titanic_enriched.csv")

Crea una columna con el año de nacimiento del pasajero

In [62]:
df["birth_year"] = 1912 - df.Age

In [63]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,title,is_big,birth_year
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0,Mr,True,1882.0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1,Mrs,True,1879.0
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0,Mrs,True,1873.0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1,Mrs,True,1885.0
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1,Miss,True,1862.0

Eran más caros los billetes de primera clase?

In [73]:
df.groupby("Pclass").Fare.mean().round(1)

Pclass
1    87.5
2    21.2
3    13.3
Name: Fare, dtype: float64

In [74]:
df.groupby("Pclass").Fare.median().round(1)

Pclass
1    60.0
2    15.0
3     8.0
Name: Fare, dtype: float64

Eran más jovenes los hombres que las mujeres del titanic?

Afectó el número de familiares a la probabilidad de sobrevivir?

Crea una columna que almacene si el número de ticket del pasajero contiene alguna letra. Define para ello una función y usa `apply`

Exporta los datos a un csv llamado `titanic_enriched.csv`